[
    {
        "id": 0,
        "companyName": "Zelene Technologies Inc",
        "position": "Front End Developer",
        "dateRange": "April - September 2023",
        "description": [
            {   
                "id": 0,
                "text": "Contributed as a Front-End Developer to the development of an expense-management web application by creating 25+ pages and collaborating with UX/UI and backend teams to integrate APIs and meet business needs."
            },

            {
                "id": 1,
                "text": "Used Redux for state management, ensuring seamless data flow and a responsive user experience and make API calls to a Python/Django backend, enabling real-time data synchronization between front-end and back-end systems."
            },

            {
                "id": 2,
                "text": "Working with a cross-functional team, handled and manage two interns to develop the front end side of the project and made sure to commit to tasks ahead of the deadline"
            }
        ]
    },
    {
        "id": 1,
        "companyName": "Invo Inc.",
        "position": "Web Developer",
        "dateRange": "Nov 2023 - April 2024",
        "description": [
            { 
                "id": 0,
                "text": "Work as a Web Developer, deploying, building, and learning different frameworks to meet web standards and client demand. Use multiple frameworks in tandem to build working and up to standard websites that are used to upscale client’s businesses"
            },
            { 
                    "id": 1,
                "text": "Diagnosed and troubleshooted different websites improving its user friendly experience and features"
            },
            { 
                    "id": 2,
                "text": "Strategically utilized different frameworks as the cornerstone of the frontend architecture. Leveraging each of its strengths from ensuring a well made and scalable design approach to enhancing the application's responsiveness and user experience"
            }
        ]
    },
    {
        "id": 2,
        "companyName": "The Landmark Corporation",
        "position": "Programmer",
        "dateRange": "May 2024 - Dev 2024",
        "description": [
            { 
                "id": 0,
                "text": "Worked as a full-time Programmer and was responsible for creating and modifying forms and reports using PL/SQL and Oracle, meeting the operational needs of the company. Collaborating closely with team members, I have contributed to the development and refinement of over 60 forms and reports, essential for the successful launch of a new branch."},

            {
                "id": 1,
                "text":  "Leveraged PL/SQL and Oracle Forms to design, implement, and optimize solutions based on company’s business process and in tandem with Oracle Reports and Oracle DBMS to process and retrieve business information that would be used to generate reports that are required in every day business transactions, audits, and other business related processes"
            }
        ]
    }
]